<h1> Data Science Bootcamp Module 3 - Structured Query Language </h1>
<hr>

<p>
    Throughout this module you will learn to work with the programming language SQL. <br>
    To start working with SQLite in VSCode, first install the SQLite extension using the extension tab on the left. <br>
    You will be working with a simple database consisting of three tables, which are comprised of the following columns:
    <ol>
        <li>
            <b><u>customers</u></b>
            <ul>
                <li> <b>id</b>: The unique ID reference of the customer. </li>
                <li> <b>firstName</b>: The first name of the customer. </li>
                <li> <b>lastName</b>: The last name of the customer. </li>
                <li> <b>address</b>: The street name and house number of the customer. </li>
            </ul>
        </li>
        <br>
        <li>
            <b><u>products</u></b>
            <ul>
                <li> <b>id</b>: The unique ID reference of the product. </li>
                <li> <b>name</b>: The name of the product, as displayed to the customer. </li>
                <li> <b>price</b>: The purchase price of the product. </li>
                <li> <b>stock</b>: The amount of products currently in stock. </li>
            </ul>
        </li>
        <br>
        <li>
            <b><u>orders</u></b>
            <ul>
                <li><b>id</b>: The unique ID reference of the order. </li>
                <li><b>customerId</b>: The ID reference of the customer that placed the order. </li>
                <li><b>productId</b>: The ID reference of the product the order is placed for. </li>
                <li><b>date</b>: The date the order is placed on. </li>
                <li><b>quantity</b>: The amount of the given product purchased. </li>
            </ul>
        </li>
    </ol>
</p>

<hr>
<h3>A. Import libraries and create database. </h3>
<p>
Before starting to write code, first all Python libraries need to be imported. <br>
We already pre-written some code to create a Database for you, populated with the data mentioned above. <br>
The Database object is called "db", which also allows you to write and execute queries. <br>
To write queries you simple execute the code: <code>db.execute_query(<i>[YOUR QUERY HERE]</i>)</code>.
</p>

In [109]:
from Modules.M3_SQL.libs.database import Database
db = Database()

<hr>
<h3> B. Basic operations </h3>
<p>
First we will explore the basic operations, namely SELECT, FROM, WHERE and LIMIT. <br>
These operations form the base of most queries that you will write in the future, as they are most fundamental to the retrieval of data. <br>
The operations and their functionality will be listed below:
<ul>
    <li> <b>SELECT</b> - Defines the column values that you desired to retrieve. </li>
    <li> <b>FROM</b> - Defines the table from which these values need to be retrieved. </li>
    <li> <b>WHERE</b> - Defines the condition(s) that will affect which rows are returned. </li>
    <li> <b>LIMIT</b> - Defines the number of rows that are returned. </li>
    <li> <b>ORDER BY</b> - Defines the way the records that are returned will be sorted. </li>
</ul>
In this module you will explore the functionalities of these operators using the just created database. <br>
The tables and their columns are described in the beginning of this notebook, which description can be used throughout the exercises below.
</p>

<p>
The first queries you will write are simple retrieval queries, which only use the <b> SELECT </b> and <b> FROM </b> operators. <br>
Write the following queries:
<ol>
    <li> Retrieve all available information regarding products contained in the products table. </li>
    <li> Retrieve the customerId, ProductId and quantity of the orders that consists of a quantity of 5 or more products. </li>
    <li> Retrieve first and last name of all customers with a first name that starts with a "J". </li>
    <li> Retrieve all available information of the top 6 largest orders in terms of quantity. </li>
    <li> Retrieve only the name of the cheapest product in the products table. </li>
</ol>
</p>

In [110]:
Q_B1 = "SELECT * FROM Products;"

db.execute_query(query=Q_B1, return_df=True, exercise="B1")

                        name   price  stock
id
0   Copying paper (500 pcs.)    4.95    304
1           Binders (3 pcs.)    8.30     33
2              Office chairs  159.99     25
3                       Desk  254.99     12
4                 PC monitor  188.99     48
5             Computer mouse   16.99     80
6             Pens (50 pcs.)   23.60    143
7       Black toners (2pcs.)   39.95    228

In [111]:
Q_B2 = "SELECT customerId, productId, quantity FROM Orders WHERE quantity >= 5;"

db.execute_query(query=Q_B2, return_df=True, exercise="B2")

   customerId  productId  quantity
0           5          5         5
1           1          7         5
2           8          7         5
3          11          2         6
4           0          3         6
5           2          7         6

In [112]:
Q_B3 = "SELECT firstName, lastName FROM Customers WHERE firstName LIKE 'j%';"

db.execute_query(query=Q_B3, return_df=True, exercise="B3")

  firstName lastName
0      John      Doe
1     Jamie     Dean

In [113]:
Q_B4 = "SELECT * FROM Orders ORDER BY quantity DESC LIMIT 6;"

db.execute_query(query=Q_B4, return_df=True, exercise="B4")

    customerId  productId        date  quantity
id
7            2          7  06/04/2022         6
6            0          3  12/12/2022         6
5           11          2  08/02/2022         6
19           8          7  19/12/2022         5
12           1          7  13/10/2022         5
0            5          5  07/11/2022         5

In [114]:
Q_B5 = "SELECT name, price FROM Products ORDER BY price LIMIT 1;"

db.execute_query(query=Q_B5, return_df=True, exercise="B5")

                       name  price
0  Copying paper (500 pcs.)   4.95

<hr>
<h3> C. Database operations </h3>
<p>
Besides execution of basic reading operations, also a lot of database operations are available. <br>
These operations include Creating, Updating an Deleting operations. <br>
These operations form the foundation for every Database developer and/or administrator. <br>
Understanding these functionalities, you will be able to create, access and manipulate databases. <br>
The operations and their functionaltiy will be listed below:
<ul>
    <li> <b>CREATE TABLE</b> - Creates a table with the given table name. </li>
    <li> <b>INSERT INTO</b> - Allows you to add new records to the database table. </li>
    <li> <b>UPDATE</b> - Allows you to adjust data in existing records within the database table. </li>
    <li> <b>DELETE FROM</b> - Allows you to delete one or multiple data records from the database table. </li>
    <li> <b>DROP TABLE</b> - Allows you to drop an entire table from the database. </li>
</ul>
</p>

<h7> <b> -- C1. CREATE TABLE -- </b> </h7>
<p>
Write a query that creates a new table called 'campaigns', which contains all marketing campaigns of different products. <br>
The table should consists of the following columns and their corresponding data types:
<ol>
    <li><b>id</b> - Integer, Primary Key, Auto Increment</li>
    <li><b>productId</b> - Integer, Foreign Key (reference: products.id)</li>
    <li><b>campaignStart</b> - Timestamp </li>
    <li><b>campaignEnd</b> - Timestamp </li>
    <li><b>Discount</b> - float </li>
</ol>
</p>

In [115]:
Q_C1_1 = """CREATE TABLE campaigns (
        id INTEGER PRIMARY KEY AUTOINCREMENT, 
        productId INTEGER,
        campaignStart DATE,
        campaignEnd DATE,
        discount FLOAT,
        FOREIGN KEY (productId) REFERENCES products(id)
        );
    """

db.execute_query(query=Q_C1_1)

'Table created successfully!'

<h7> <b> -- C2. INSERT INTO -- </b> </h7>
<p>
Now it is time to populate your newly created table. <br>
Please insert the following data onto the campaigns table: <br>
<code> { <br>
    &nbsp; productId: 4, <br>
    &nbsp; campaignStart: '2022-01-01', <br>
    &nbsp; campaignEnd: '2022-04-08', <br>
    &nbsp; discount: 0.20 <br>
} </code> <br>

<code> { <br>
    &nbsp; productId: 6, <br>
    &nbsp; campaignStart: '2022-02-02', <br>
    &nbsp; campaignEnd: '2022-06-23', <br>
    &nbsp; discount: 0.15 <br>
} </code> <br>

<code> { <br>
    &nbsp; productId: 4, <br>
    &nbsp; campaignStart: '2022-04-20', <br>
    &nbsp; campaignEnd: '2022-07-15', <br>
    &nbsp; discount: 0.30 <br>
} </code> <br>

<code> { <br>
    &nbsp; productId: 7, <br>
    &nbsp; campaignStart: '2022-10-20', <br>
    &nbsp; campaignEnd: '2022-12-31', <br>
    &nbsp; discount: 0.125 <br>
} </code> <br>

</p>

In [116]:
Q_C2_1 = "INSERT INTO campaigns(productId, campaignStart, campaignEnd, Discount) VALUES (4, '2022-01-01', '2022-04-08', 0.20);"

db.execute_query(query=Q_C2_1)

'Data inserted successfully!'

In [117]:
Q_C2_2 = "INSERT INTO campaigns(productId, campaignStart, campaignEnd, Discount) VALUES (6, '2022-02-02', '2022-06-23', 0.15);"

db.execute_query(Q_C2_2)

'Data inserted successfully!'

In [118]:
Q_C2_3 = "INSERT INTO campaigns(productId, campaignStart, campaignEnd, Discount) VALUES (4, '2022-04-01', '2022-07-15', 0.30);"

db.execute_query(Q_C2_3)

'Data inserted successfully!'

In [119]:
Q_C2_4 = "INSERT INTO campaigns(productId, campaignStart, campaignEnd, Discount) VALUES (7, '2022-10-20', '2022-12-31', 0.125);"

db.execute_query(Q_C2_4)

'Data inserted successfully!'

In [120]:
db.execute_query("SELECT * FROM campaigns;", return_df=True)

'Please provide the exercise name in the function if you want to save the outputs.'

<h7> <b> -- C3. UPDATE -- </b> </h7>
<p>
We have actually made some mistake with inserting the campaigns into the database. <br>
Make the following adjustments to the database records: <br>
<ol>
    <li> For the campaign with id 1, Change the start date from: '2022-01-01' to '2022-01-25'. </li>
    <li> For the campaign(s) with end date '2022-06-23', Change the start date to '2022-01-01' and the end date to '2022-12-31'. </li>
    <li> For the campaign(s) concerning productId 4, change the discount to 0.25. </li>
</ol>
</p>

In [121]:
Q_C3_1 = "UPDATE campaigns SET campaignStart='2022-01-25' WHERE id=1;"

db.execute_query(Q_C3_1)

'Data record updated successfully!'

In [122]:
Q_C3_2 = "UPDATE campaigns SET campaignStart='2022-01-01', campaignEnd='2022-12-31' WHERE campaignEnd='2022-06-23';"

db.execute_query(Q_C3_2)

'Data record updated successfully!'

In [123]:
Q_C3_3 = "UPDATE campaigns SET discount = 0.25 WHERE productId = 4;"

db.execute_query(Q_C3_3)

'Data record updated successfully!'

In [124]:
db.execute_query("SELECT * FROM campaigns;", return_df=True)

'Please provide the exercise name in the function if you want to save the outputs.'

<h7> <b> -- C4. DELETE FROM -- </b> </h7>
<p>
Deletion of record can also be done in a similar manner as previous database mutations using the WHERE clause. <br>
Write the queries executing the following behavior:
<ol>
    <li> Remove all campaigns that concern productId 6. </li>
    <li> Remove all other campaigns, emptying the database table. </li>
</ol>

</p>

In [125]:
Q_C4_1 = "DELETE FROM campaigns WHERE productId = 6;"

db.execute_query(Q_C4_1)

'Data record deleted successfully!'

In [126]:
Q_C4_2 = "DELETE FROM campaigns;"

db.execute_query(Q_C4_2)

'Data record deleted successfully!'

<h3><b> CAUTION!</b></h3>
<p> 
The last query you wrote to remove all campaigns shows the danger of using the <b> DELETE FROM </b> operator. <br>
When using this operator make sure to <b>always include a where condition</b>, as otherwise the database table is emptied. <br>
If such a query without a condition is executed on an actual database table the data will be removed without a possibility of to be retrieved.
</p>

<h7> <b> -- C5. DROP TABLE -- </b> </h7>
<p>
The created campaigns table is only created and used to practice the database operators. <br>
For the following excersises we will clean the database by dropping the campaigns table. <br>
Write a query that drops the table from te database, only leaving the Customers, Products and Orders tables.
</p>

In [127]:
Q_C5_1 = "DROP TABLE campaigns;"

db.execute_query(Q_C5_1)

'Table dropped successfully!'

<hr>
<h3> D. Calculation operators </h3>
<p>
Next we will look into calculation operators, which extends the possibilities of what can be retrieved from the database. <br>
Instead of simply using the <b>SELECT</b> operator, the calculation operators can perform calculations on the values that are retrieved. <br>
There are a lot of possible calculation operators, however the most commonly used are the Max, Min, Sum and Count operators. <br>
Together with the <b>GROUP BY</b> operator you can perform some useful calculative queries that are able to return great Business Intelligence. <br>
When using <b>GROUP BY</b>, conditional retrieval is done using <b>HAVING</b> instead of <b>WHERE</b>, which also works for calculations. <br>
Write the following queries:
<ol>
    <li> Retrieve the total number of orders that are contained in the orders table. </li>
    <li> Return the product name and the total value stored in inventory (price * stock). </li>
    <li> Return the productId and the largest quantity ordered for all products separately (using <b>GROUP BY</b>). </li>
    <li> Return the productId and the number of different customers for all products separately (using <b>DISTINCT()</b>), only returning products with two or more distinct customers. </li>
</ol>
</p>

In [128]:
Q_D1 = "SELECT COUNT(*) AS NumberOfOrders FROM orders;"

db.execute_query(query=Q_D1,  return_df=True, exercise="D1")

   NumberOfOrders
0              20

In [129]:
Q_D2 = "SELECT name, price*stock AS Inventory FROM products;"

db.execute_query(query=Q_D2, return_df=True, exercise="D2")

                       name  Inventory
0  Copying paper (500 pcs.)    1504.80
1          Binders (3 pcs.)     273.90
2             Office chairs    3999.75
3                      Desk    3059.88
4                PC monitor    9071.52
5            Computer mouse    1359.20
6            Pens (50 pcs.)    3374.80
7      Black toners (2pcs.)    9108.60

In [130]:
Q_D3 = "SELECT productId, max(quantity) AS largestQuantity FROM orders GROUP BY productId;"

db.execute_query(query=Q_D3, return_df=True, exercise="D3")

   productId  largestQuantity
0          0                4
1          1                2
2          2                6
3          3                6
4          4                4
5          5                5
6          6                4
7          7                6

In [131]:
Q_D4 = "SELECT productId, COUNT(DISTINCT(customerId)) AS distinctCustomers FROM orders GROUP BY productId HAVING distinctCustomers >= 2;"

db.execute_query(query=Q_D4, return_df=True, exercise="D4")

   productId  distinctCustomers
0          0                  2
1          3                  4
2          5                  2
3          6                  2
4          7                  4

<hr>
<h3> E. Writing complex (multi-table) queries </h3>
<p>
To enable the full extend of the capabilities of the SQL language, the <b>JOIN</b> operator will be introduced. <br>
JOIN allows you to query data from multiple tables, which enables you to write complex multi-table queries. <br>
Within this module you will be asked to use both the <b>basic</b> and <b>Calculation</b> operators combined with <b>JOIN</b>. <br>
<br>

Besides the <b>JOIN</b> operator, it is also possible to include other information using <b>sub-queries</b>. <br>
<b>Sub-queries</b> allow you to use the results of a sub-query in a conditional statement for another query. <br>
Such queries can for example be used to retrieve all information of customers that placed at least one order with a quantity larger than 3. <br>
This information can be retrieved using the query: <br>
<code> SELECT * FROM customers WHERE customers.id IN (SELECT customerId FROM orders WHERE quantity > 3) </code>. <br>
<br>

The queries you have to write will be formulated as requests from different departments. <br>
If you will be working with databases in the future, you will be faced with such query requests. <br>
Write the following queries:
<ol>
    <li> Sales wants to analyse the number of products that are ordered 3 or more times, retrieve only the product names. <br>
    <li> The marketing department asks for all first and last names of customers who ordered a "Desk" in the past. </li>
    <li> Upper management wants to gain insight in consumer behavior. Calculate the total spend per customer and display the first and last name together with the total spend in ascending order based on total spend. </li>
    <li> For our customer loyalty program we want to retrieve a list of first and last names of customers that made at least 2 orders in the past with an average order value above 250 euros. <br>
</ol>
</p>

In [132]:
Q_E1 = """
    SELECT products.id, products.name, COUNT(orders.id) AS NumberOfOrders
    FROM products
    INNER JOIN orders ON products.id = orders.productId 
    GROUP BY products.name
    HAVING NumberOfOrders >= 3;
    """

db.execute_query(query=Q_E1, return_df=True, exercise="E1")

                        name  NumberOfOrders
id
7       Black toners (2pcs.)               4
5             Computer mouse               3
0   Copying paper (500 pcs.)               4
3                       Desk               4

In [133]:
Q_E2 = """
    SELECT customers.firstName, customers.lastName
    FROM customers
    WHERE customers.id IN (
        SELECT orders.customerId 
        FROM orders 
        INNER JOIN products ON products.id = orders.productId
        WHERE products.name = 'Desk'
    );
    """

db.execute_query(query=Q_E2, return_df=True, exercise="E2")

  firstName lastName
0      John      Doe
1    Ashton     Cole
2    Raylee     Diaz
3   Cameron   Taylor

In [134]:
Q_E3 = """
    SELECT customers.firstName, customers.lastName, SUM(orders.quantity * products.price) AS totalSpend
    FROM customers
    INNER JOIN orders ON orders.customerId = customers.id
    INNER JOIN products ON products.id = orders.productId
    GROUP BY customers.id
    ORDER BY totalSpend DESC;
    """

db.execute_query(query=Q_E3, return_df=True, exercise="E3")

  firstName lastName  totalSpend
0   Cameron   Taylor     1996.50
1      John      Doe     1529.94
2      Shay     Hyde      835.86
3    Ashton     Cole      454.74
4    Arthur   Holmes      328.80
5    Raylee     Diaz      325.79
6     Jamie     Dean      239.70
7   Vicente   Bryant      152.91
8      Reed    Nixon       33.98
9     Axton   Rogers       19.80

In [135]:
Q_E4 = """
    SELECT customers.firstName, customers.lastName
    FROM customers
    WHERE customers.Id IN (
        SELECT orders.customerId
        FROM orders
        INNER JOIN products ON orders.productId = products.Id
        GROUP BY orders.customerId
        HAVING AVG(orders.quantity * products.price) > 250
    );
    """

db.execute_query(query=Q_E4, return_df=True, exercise="E4")

  firstName lastName
0      John      Doe
1      Shay     Hyde
2   Cameron   Taylor

<hr>
<h1> Congratulations!! </h1>
<p>
You completed all modules and created all queries that are requested! <br>
Through running other queries you are able to validate whether the queries you have written are correct. <br>
However, to have a final check, we build in a mechanism that will check whether your queries show the desired, requested behavior. <br>
To kick off these tests, you only have to push this directory to the main Git branch. <br>
This can be done using the following steps:
<ol>
    <li> Open the command prompt in VS Code by pressing <b>CTRL</b> + <b>`</b>. </li>
    <li> Write the command <code>git status</code> to check which differences there are between your current and the master branch. </li>
    <li> Write the command <code>git add Modules/M3_SQL/</code> to add the main notebook to the staging lane. </li>
    <li> Write the command <code>git commit -m "<i>[INSERT COMMIT MESSAGE]</i>"</code> to commit the staged changes and adding a descriptive commit message. </li>
    <li> Finally, write the command <code>git push</code> to push the staged changes to the master branch. </li>
    <li> Upon pushing the changes, the PyTest modules will be run to check your answers, for which an overview is generated in your Github </li>
</ol>
If you pass all tests, feel free to continue to our next module, <b>Module 4: Machine Learning (ML)</b>.
</p>